export default {
	// header
    games: 'Игры',
    leaderboard: 'Таблица лидеров',
    rules: 'Правила',
    login: 'Войти',
    en: 'Англ',
    ru: 'Рус',

    // footer
    issueOnGithub: 'Сообщить об ошибке на Github',

    // ----------------------------- HOME PAGE

    // parallax section
    slogan1: 'Ты не просто играешь в игру',
    slogan2: 'Пошаговая стратегия по развитию твоего ИИ',
    slogan3: 'Начни свое новое кодинг-приключение за 3 простых шага',
    loading: 'Загрузка...',

    // steps section
    step1Title: 'Получи образец бота',
    step1Text1: 'Выбери язык программирования, на котором предпочитаешь кодить. Склонируй образц репозитория или',
    import: 'импортируй',
    step1Text2: 'его. Ты можешь выбрать образец из следующих языков программирования.',
    step2Title: 'Привяжи свой репозиторий',
    step2Text: 'В твоем репозитории укажи свое имя пользователя в ANTHIVE файле. Свяжи свой репозиторий на странице настроек профиля.',
    profile: 'Профиль',
    step3Title: 'Напиши стратегию бота',
    step3Text: 'Рефакторинг кода твоей стратегии. Git push в origin. Запускай игры, соревнуйся и поднимайся в',
    step3leaderboard: 'таблице лидеров',

    // feature section
    feature1Title: 'Учись',
    feature1Text: 'Всегда хотел изучить программирование, но не знал, с чего начать? Начните прямо здесь. Эта пошаговая стратегия является наиболее интересным способом изучения реального кода. Выберите язык, прочитайте правила и начните программировать прямо сейчас.',
    feature2Title: 'Практикуйся',
    feature2Text: 'Продолжайте практиковаться и улучшать свои навыки программирования, играя в эту игру. Эта игра - отличный способ развить свои навыки программирования, развлекаясь и соревнуясь. Освой свой текущий язык программирования; или улучши навыки написания на нем. По завершении уровней ты получаешь трофеи и сертификаты, которые принесут тебе пользу не только в игре, но и в реальной жизни.',
    feature3Title: 'Соревнуйся',
    feature3Text: 'Продемонстрируй свои навыки, соревнуясь с другими разработчиками на выбранном тобой языке. Эта платформа позволяет тебе сражаться не только с другими разработчиками по всему миру, но и с ботами, написанными на разных языках на одной карте и в одно время. Продемонстрируй всем, что твоя стратегия лучше, твой код наиболее эффективен и не содержит ошибок. Поднимайся по таблице лидеров, улучшая свою стратегию. Пусть твой бот доминирует на турнирах.',

    // video section
    videoTitle: 'Начни прямо сейчас!',
    videoText1: 'Это пошаговая стратегическая игра по созданию твоего собственного бота.',
    videoText2: 'Рассчитай, обдумай и планируй каждый шаг твоих муравьев. Командуй своими муравьям, чтобы они собирали пищу, приносили ее в твой улей и выращивали колонию.',
    videoText3: 'Игрок с самой большой колонией и наименьшим количеством ошибок выигрывает игру. Чтобы начать игру, выполни три шага ниже.',
    videoText4: 'Для ознакомления с правилами перейди по ссылке',

    // badges section
    badgesTitle: 'Значки и рейтинг',
    badgesText1: 'Равным образом консультация с широким активом в значительной степени обуславливает создание форм развития.',
    badgesText2: 'Задача организации, в особенности же рамки и место обучения кадров позволяет оценить значение соответствующий условий активизации.',
    badgesText3: 'Не следует, однако забывать, что консультация с широким активом требуют от нас анализа модели развития.',

    // feedback section
    subscribe: 'Подписаться',
    feedbackText1: 'Оставайся на связи и получай последние новости первым!',
    feedbackTitle2: 'Нашел ошибку?',
    feedbackText2: 'Сообщий о ней нам в нашем gitgub репозитории и мы ее исправим!',
    feedbackBtn2: 'Сообщить об ошибке',

    // ----------------------------- GAMES PAGE
    gamesTitle1: 'Все битвы:',
    gamesTitle2: 'Исследуйте, смотрите, воспроизводите, изучайте стратегии',

    // table
    gamesLoading: 'Загрузка... Пожалуйста подождите',
    gamesPlayer: 'Игрок',
    gamesTicks: 'Тик',
    gamesWealth: 'Очки',
    gamesDate: 'Дата',

    // user
    mAgo: 'м назад',
}