export default {
  // header
  games: 'Игры',
  leaderboard: 'Таблица лидеров',
  rules: 'Правила',
  login: 'Войти',
  en: 'Англ',
  ru: 'Рус',

  // footer
  ReadFooter: 'Ознакомьтесь с',
  AndFooter: 'и',
  PrivacyPolicy: 'Политикой конфиденциальности',
  TermsofService: 'Условиями использования',

  // ----------------------------- HOME PAGE

  // parallax section
  slogan1: 'Ты не просто играешь в игру',
  slogan2: 'Пошаговая стратегия по развитию твоего ИИ',
  slogan3: 'Начни свое новое кодинг-приключение за 3 простых шага',
  loading: 'Загрузка...',
  buttonJoin: `Присоединится с Github`,
  buttonSandbox: `sandbox`,

  // steps section
  stepsTitle: 'Присоединиться к Anthive за 3 шага',
  step1Title: 'Получи образец бота',
  step1Text1: 'Выбери язык программирования, на котором предпочитаешь кодить. Склонируй образц репозитория или',
  import: 'импортируй',
  step1Text2: 'его. Ты можешь выбрать образец из следующих языков программирования.',
  step2Title: 'Привяжи свой репозиторий',
  step2Text:
    'В твоем репозитории укажи свое имя пользователя в ANTHIVE файле. Свяжи свой репозиторий на странице настроек профиля.',
  profile: 'Профиль',
  step3Title: 'Напиши стратегию бота',
  step3Text: 'Рефакторинг кода твоей стратегии. Git push в origin. Запускай игры, соревнуйся и поднимайся в',
  step3leaderboard: 'таблице лидеров',

  // feature section
  feature1Title: 'Учись',
  feature1Text:
    'Всегда хотел изучить программирование, но не знал, с чего начать? Начните прямо здесь. Эта пошаговая стратегия является наиболее интересным способом изучения реального кода. Выберите язык, прочитайте правила и начните программировать прямо сейчас.',
  feature2Title: 'Практикуйся',
  feature2Text:
    'Эта игра - отличный способ развить свои навыки программирования, развлекаясь и соревнуясь. Освой свой текущий язык программирования; или улучши навыки написания на нем. По завершении уровней ты получаешь трофеи и сертификаты, которые принесут тебе пользу не только в игре, но и в реальной жизни.',
  feature3Title: 'Соревнуйся',
  feature3Text:
    'Продемонстрируй свои навыки, соревнуясь с другими разработчиками на выбранном тобой языке. Продемонстрируй всем, что твоя стратегия лучше, твой код наиболее эффективен и не содержит ошибок. Поднимайся по таблице лидеров, улучшая свою стратегию. Пусть твой бот доминирует на турнирах.',

  // video section
  sectionTitle: 'Начни прямо сейчас!',
  videoTitle: 'Это пошаговая стратегическая игра по созданию твоего собственного бота.',
  videoText1:
    'Рассчитай, обдумай и планируй каждый шаг твоих муравьев. Командуй своими муравьям, чтобы они собирали пищу, приносили ее в твой улей и выращивали колонию.',
  videoText2:
    'Игрок с самой большой колонией и наименьшим количеством ошибок выигрывает игру. Чтобы начать игру, выполни три шага ниже.',
  videoText3: 'Для ознакомления с правилами перейди по ссылке',

  // badges section
  badgesTitle: 'Значки и рейтинг',
  badgesText1:
    'Равным образом консультация с широким активом в значительной степени обуславливает создание форм развития.',
  badgesText2:
    'Задача организации, в особенности же рамки и место обучения кадров позволяет оценить значение соответствующий условий активизации.',
  badgesText3:
    'Не следует, однако забывать, что консультация с широким активом требуют от нас анализа модели развития.',

  // feedback section
  subscribe: 'Подписаться',
  feedbackText1: 'Оставайся на связи и получай последние новости первым!',
  feedbackTitle2: 'Нашел ошибку?',
  feedbackText2: 'Сообщий о ней нам в нашем gitgub репозитории и мы ее исправим!',
  feedbackBtn2: 'Сообщить',

  // screenshot section
  screenshot1Title: 'Скриншот 1',
  screenshot2Title: 'Скриншот 2',
  screenshot3Title: 'Скриншот 3',

  // ----------------------------- GAMES PAGE
  gamesTitle1: 'Все битвы:',
  gamesTitle2: 'Исследуйте, смотрите, воспроизводите, изучайте стратегии',

  // table
  gamesLoading: 'Загрузка... Пожалуйста подождите',
  gamesPlayer: 'Игрок',
  gamesTicks: 'Тики',
  gamesWealth: 'Очки',
  gamesDate: 'Дата',

  // ----------------------------- LEADERBOARD PAGE
  leadGames: 'игр',
  leadWealth: 'очков',

  // ----------------------------- USER PAGE
  userGames: 'Игры:',
  userTitle: 'Производительность бота за последние 10 дней',

  // ----------------------------- USER INFO FULL PAGE
  infoBotInfo: 'Информация о боте',
  infoSpan: 'Спан:',
  infoTicks: 'Тики:',
  infoAnts: 'Муравьи:',
  infoHiveSize: 'Размер муравейника:',
  infoErrors: 'Ошибки:',
  infoEarned: 'Очки:',

  // ----------------------------- RULES PAGE
  rulesText:
    'Как быстро узнать насколько сильный ты программист?\n\n Предлагаем вам поучаствовать в  уникальном соревновании позволяющим отточить свои навыки программирования или научиться  чему-то новому.\n\n AntHIve.IO - пошаговая игра в кодирование. Каждый из нас хотя бы раз в жизни наблюдал, как трудятся муравьи. И кажется в этом хаосе довольно сложно разглядеть какую-либо упорядоченную структуру. Но это не так. Всё подчиняется определённым законам и как программист сможешь ли ты описать их с помощью твоего любимого языка программирования. \n\n На самом деле всё очень просто. Поэтому неважно какой опыт у вас за плечами. Разобраться в правилах этой игры сможет как опытный специалист так и новичок, который ни разу в жизни не пробовал написать код. \n\n (рисунок) Муравей с пальцем вверх. \n\n Цель игры: \n\n Сделать максимально большой муравейник постаравшись при этом допустить как можно меньше ошибок. \n\n Правила: \n\n Создать муравейник вы можете с помощью одного из 7 языков программирования. \n\n (рисунок)  Окошечко с 7 логотипами языков программирования.\n\n И так игра началась. В вашем распоряжении один муравей, который готов совершать подвиги на благо колонии. Он голоден. Поэтому его главной задачей будет поиск еды на карте.\n\n (рисунок)Муравей на карте. Стрелочкой показать его направление к еде. В качестве еды яблоко. \n\n  На заданной территории пища появляется случайно и в различных количествах. Муравей должен добраться до еды. И тут вы выбираете одну из двух стратегий. Работник может поесть или отнести еду в колонию. \n\n (рисунок) Муравей с облачком над головой. В облачке вопросик. \n\n В муравейнике находятся личинки, но они должны хорошо питаться, чтобы вырасти и приносить пользу вашей колонии. Поэтому когда рабочий приносит еду в муравейник, то одна из личинок становится полноценной взрослой особью. Теперь у вас два муравья. Аналогичным способом вы можете и дальше находить еду на карте и увеличивать численность своих рабочих. \n\n (рисунок)Показать пример, как еда превращается в муравья. \n\n Как начать играть? \n\n Для начала работы с одним из языков программирования предоставлен стартовый код со стратегией хаотичного движения муравьев. Ваша задача основываясь на предоставленной информации о карте с едой заставить работать ваших муравьёв таким образом, чтобы ваш муравейник стал самым большим.\n\n Рассмотрим возможные ошибки, которые могут возникнуть в процессе игры:\n\n 1. Запрещён выход за территорию карты, а также нельзя заходить на клетку с едой или на клетку чужого муравейника;\n\n 2. Когда два муравья хотят зайти на одну и ту же клетку, то получит ошибку и останется на месте тот чей ответ был медленней;\n\n 3. Убедитесь, что ваш код достаточно быстрый. На каждый шаг вам даётся не более 500 мсек. Когда лимит по времени превышен, то муравьи останутся без движения. \n\n Предусмотрена определенная система вознаграждения и мотивации. Вы совершенствуете свою стратегию. Это позволяет проходить уровень за уровень. Как специалист вы становитесь сильнее, что отображается в списке лидеров. \n\n Добейся действительно выдающихся результатов. Покажи себя на международном уровне. Участвуй в турнирах и побеждай. \n\n'
}
